TestServicesSoap/src/test/resources/soap/fileOfficialRate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://www.xignite.com/services/">
    <soap:Header>
        <ser:Header>
            <ser:Username>%s</ser:Username>
            <ser:Password>?</ser:Password>
            <ser:Tracer>?</ser:Tracer>
        </ser:Header>
    </soap:Header>
    <soap:Body>
        <ser:GetOfficialRate>
            <ser:Country>%s</ser:Country>
            <ser:Symbol>%s</ser:Symbol>
            <ser:AsOfDate>%s</ser:AsOfDate>
        </ser:GetOfficialRate>
    </soap:Body>
</soap:Envelope>